
var BankInfo = function() {

	bankInfo = [ 
		{
		  "D1은행번호": "002",
		  "D1은행명": "002.산업은행"
		},
		{
		  "D1은행번호": "003",
		  "D1은행명": "003.기업은행"
		},
		{
		  "D1은행번호": "004",
		  "D1은행명": "004.국민은행"
		},
		{
		  "D1은행번호": "007",
		  "D1은행명": "007.수협중앙회"
		},
		{
		  "D1은행번호": "008",
		  "D1은행명": "008.수출입은행"
		},
		{
		  "D1은행번호": "011",
		  "D1은행명": "011.농협은행"
		},
		{
		  "D1은행번호": "012",
		  "D1은행명": "012.지역농축협"
		},
		{
		  "D1은행번호": "020",
		  "D1은행명": "020.우리은행"
		},
		{
		  "D1은행번호": "023",
		  "D1은행명": "023.SC은행"
		},
		{
		  "D1은행번호": "027",
		  "D1은행명": "027.한국씨티은행"
		},
		{
		  "D1은행번호": "031",
		  "D1은행명": "031.대구은행"
		},
		{
		  "D1은행번호": "032",
		  "D1은행명": "032.부산은행"
		},
		{
		  "D1은행번호": "034",
		  "D1은행명": "034.광주은행"
		},
		{
		  "D1은행번호": "035",
		  "D1은행명": "035.제주은행"
		},
		{
		  "D1은행번호": "037",
		  "D1은행명": "037.전북은행"
		},
		{
		  "D1은행번호": "039",
		  "D1은행명": "039.경남은행"
		},
		{
		  "D1은행번호": "045",
		  "D1은행명": "045.새마을금고"
		},
		{
		  "D1은행번호": "048",
		  "D1은행명": "048.신협중앙회"
		},
		{
		  "D1은행번호": "050",
		  "D1은행명": "050.상호저축은행"
		},
		{
		  "D1은행번호": "052",
		  "D1은행명": "052.모건스탠리은행"
		},
		{
		  "D1은행번호": "054",
		  "D1은행명": "054.HSBC은행"
		},
		{
		  "D1은행번호": "055",
		  "D1은행명": "055.도이치은행"
		},
		{
		  "D1은행번호": "056",
		  "D1은행명": "056.알비에스은행"
		},
		{
		  "D1은행번호": "057",
		  "D1은행명": "057. JP모건체이스은행"
		},
		{
		  "D1은행번호": "058",
		  "D1은행명": "058.미즈호코퍼레이트은행"
		},
		{
		  "D1은행번호": "059",
		  "D1은행명": "059.B.T.M."
		},
		{
		  "D1은행번호": "060",
		  "D1은행명": "060.B.O.A."
		},
		{
		  "D1은행번호": "064",
		  "D1은행명": "064.산림조합중앙회"
		},
		{
		  "D1은행번호": "071",
		  "D1은행명": "071.우체국"
		},
		{
		  "D1은행번호": "076",
		  "D1은행명": "076.신용보증기금"
		},
		{
		  "D1은행번호": "077",
		  "D1은행명": "077.기술보증기금"
		},
		{
		  "D1은행번호": "081",
		  "D1은행명": "081.하나은행"
		},
		{
		  "D1은행번호": "088",
		  "D1은행명": "088.신한은행"
		},
		{
		  "D1은행번호": "089",
		  "D1은행명": "089.K뱅크"
		},
		{
		  "D1은행번호": "090",
		  "D1은행명": "090.카카오뱅크"
		},
		{
		  "D1은행번호": "093",
		  "D1은행명": "093.한국주택금융공사"
		},
		{
		  "D1은행번호": "094",
		  "D1은행명": "094.서울보증보험"
		},
		{
		  "D1은행번호": "209",
		  "D1은행명": "209.유안타증권"
		},
		{
		  "D1은행번호": "218",
		  "D1은행명": "218.KB증권"
		},
		{
		  "D1은행번호": "224",
		  "D1은행명": "224.BNK투자증권"
		},
		{
		  "D1은행번호": "238",
		  "D1은행명": "238.미래에셋대우"
		},
		{
		  "D1은행번호": "240",
		  "D1은행명": "240.삼성증권"
		},
		{
		  "D1은행번호": "243",
		  "D1은행명": "243.한국투자증권"
		},
		{
		  "D1은행번호": "247",
		  "D1은행명": "247.NH투자증권"
		},
		{
		  "D1은행번호": "261",
		  "D1은행명": "261.교보증권"
		},
		{
		  "D1은행번호": "262",
		  "D1은행명": "262.하이투자증권"
		},
		{
		  "D1은행번호": "263",
		  "D1은행명": "263.현대차증권"
		},
		{
		  "D1은행번호": "264",
		  "D1은행명": "264.키움증권"
		},
		{
		  "D1은행번호": "265",
		  "D1은행명": "265.이베스트증권"
		},
		{
		  "D1은행번호": "266",
		  "D1은행명": "266.SK증권"
		},
		{
		  "D1은행번호": "267",
		  "D1은행명": "267.대신증권"
		},
		{
		  "D1은행번호": "269",
		  "D1은행명": "269.한화투자증권"
		},
		{
		  "D1은행번호": "270",
		  "D1은행명": "270.하나금융투자"
		},
		{
		  "D1은행번호": "278",
		  "D1은행명": "278.신한금융투자"
		},
		{
		  "D1은행번호": "279",
		  "D1은행명": "279.동부증권"
		},
		{
		  "D1은행번호": "280",
		  "D1은행명": "280.유진투자증권"
		},
		{
		  "D1은행번호": "287",
		  "D1은행명": "287.메리츠종합금융증권"
		},
		{
		  "D1은행번호": "288",
		  "D1은행명": "288.카카오페이증권"
		},
		{
		  "D1은행번호": "290",
		  "D1은행명": "290.부국증권"
		},
		{
		  "D1은행번호": "291",
		  "D1은행명": "291.신영증권"
		},
		{
			"D1은행번호": "292",
			"D1은행명": "292.케이프투자증권"
		},
		{
		  "D1은행번호": "294",
		  "D1은행명": "294.한국포스증권"
		}
	];

	return bankInfo;
}